[
  {
    "url": "https://www.myjoyonline.com/an-open-letter-to-the-deputy-attorney-general-dr-justice-srem-sai/",
    "title": "An Open Letter to the Deputy Attorney General, Dr Justice Srem-Sai",
    "text": "Dear Dr Justice Srem-Sai, googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); I write to you with deep respect, following a recent story attributed to you in which you reaffirmed the state’s commitment to protecting journalists, punishing perpetrators of attacks against them, and compensating those harmed in the line of duty. Your words were reassuring and firmly rooted in the Constitution, which recognises the indispensable role journalists play in Ghana’s democracy. As a journalist myself, your assurance immediately brought to mind one unresolved and deeply painful case — that of my colleague, Latif Iddrisu of JoyNews. In March 2018, Latif was brutally assaulted by uniformed police officers at the CID Headquarters while carrying out his professional duty of reporting on the detention of Koku Anyidoho. That assault left him with a fractured skull and a traumatic brain injury, the effects of which he continues to endure nearly eight years on. This is not speculation. It is a lived reality. googletag.cmd.push(function() { googletag.display('in-article'); }); Latif has spent no less than $50,000 on medical care in Ghana and in California, USA, where he continues to undergo therapy. These costs have been covered through personal savings, the support of family, friends, benefactors, and the Multimedia Group. Today, he remains indebted to the Loma Linda University Medical Center in excess of $26,000, with an additional ambulance bill of about $700, excluding the cost of ongoing treatment. Read Also: Gov’t pledges protection and compensation for journalists harmed in the line of duty Legally, the matter remains unresolved. The suit against the Police was filed in 2019 and, seven years on, is still before the courts after passing through three judges. Even more concerning is that the Police Intelligence and Professional Standards (PIPS) recommended compensation, and the Police administration initially pledged to pay. Yet, to date, no compensation has been made. Several petitions have been submitted to the Office of the Attorney General, including one from His Eminence the National Chief Imam, and others from Martin Luther Kpebu Esq, Dr Kenneth Ashigbey, Professor Audrey Gadzekpo, Anas Aremeyaw Anas, and other respected citizens. Professional bodies such as the Ghana Journalists Association have also consistently appealed for redress. Regrettably, these efforts have not yet yielded closure or relief. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); Dr Srem-Sai, I raise this matter with humility and respect, not as a demand, but as an earnest appeal. If the state’s promise to journalists is to be demonstrated in practical terms, this case presents a clear and compelling opportunity to do so. This is not about sympathy. It is about constitutional responsibility, press freedom, and state accountability. It is about assuring journalists that when they are harmed in service to the public, the state will not look away. Latif Iddrisu survived a near-death experience in the line of duty. He seeks justice, compensation, and closure, not charity, but the fulfilment of a responsibility already acknowledged by the state. As you rightly stated at the Ghana Journalists Association Dinner Night on December 23, 2025. googletag.cmd.push(function() { googletag.display('in-article2'); }); “We will not harm journalists. We will not allow anyone else to harm them. We will ensure perpetrators are punished, and we will compensate any journalist who suffers harm in the line of duty.” Dr Justice Srem-Sai, this moment offers an opportunity to translate that promise into action, and to set a precedent that will strengthen press freedom and restore faith in the state’s commitment to protect journalists. Respectfully,A Ghanaian JournalistEbenezer Afanyi Dadzie googletag.cmd.push(function() { googletag.display('in-article3'); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Deputy Attorney-General Justice Srem-Sai Latif Iddrisu Protecting journalists Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story From Parliament To The Courts: Srem-Sai vs Srem-Sai and the campaign against OPS – Kay Codjoe Writes Citizen drags AG to Supreme Court over legality of OSP – Deputy AG confirms GJA pushes for compensation for Latif Iddrisu after multiple assaults Suspect who attacked JoyNews’ Latif Iddrisu during Wontumi protest arrested HRRG demands justice after NPP sympathisers assaulted JoyNews reporter Latif Iddrisu JSI demands swift police, EOCO action over assault on JoyNews’ Latif Iddrisu MFWA condemns assault on JoyNews’ Latif Iddrisu ADC condemns attack on JoyNews reporter Latif Iddrisu, demands swift justice JoyNews condemns attack on reporter Latif Iddrisu by alleged NPP supporters ‘You didn’t suffer any injury’ – State attorney tells assaulted journalist Latif Iddrisu",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/1-14-636x424.png"
  },
  {
    "url": "https://www.myjoyonline.com/ghana-nigeria-cyber-fraud-network-dupes-over-200-victims-of-400000/",
    "title": "Ghana-Nigeria cyber-fraud network dupes over 200 victims of $400,000",
    "text": "Ghanaian authorities have dismantled a major cyber-fraud network operating across Ghana and Nigeria that defrauded more than 200 victims of over $400,000, as part of a continent-wide cybercrime operation coordinated by INTERPOL. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); The network was uncovered during Operation Sentinel, which focused on business email compromise, digital extortion and ransomware activities identified as growing threats in INTERPOL’s 2025 Africa Cyber Threat Assessment Report. Investigators said the syndicate used professionally designed websites and mobile applications to impersonate well-known fast-food brands, collecting online payments from unsuspecting customers but failing to deliver any orders. INTERPOL confirmed that ten suspects were arrested in Ghana in connection with the fraud, while more than 100 digital devices were seized during coordinated raids. Authorities also took down 30 fraudulent servers used to facilitate the scam. The Ghana-Nigeria network was among several high-impact cases uncovered during the operation, which resulted in 574 arrests across Africa, the takedown of over 6,000 malicious links and the decryption of six ransomware variants. googletag.cmd.push(function() { googletag.display('in-article'); }); The crackdown revealed how cybercriminals are increasingly exploiting consumer trust in familiar brands to carry out large-scale fraud across borders, making detection and enforcement more complex. Neal Jetton, INTERPOL’s Director of Cybercrime, said the operation demonstrated the value of international cooperation in tackling cyber-enabled crime. “The scale and sophistication of cyberattacks across Africa are accelerating, especially against critical sectors like finance and energy. The outcomes from Operation Sentinel reflect the commitment of African law enforcement agencies, working in close coordination with international partners. Their actions have successfully protected livelihoods, secured sensitive personal data and preserved critical infrastructure,” he said. INTERPOL said partnerships with private sector organisations played a critical role in tracing IP addresses, disrupting criminal infrastructure and assisting authorities to freeze illicit financial assets linked to the fraud. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); Operation Sentinel was conducted under the African Joint Operation against Cybercrime and supported by funding from the United Kingdom’s Foreign, Commonwealth and Development Office, as well as the European Union and the Council of Europe through the GLACY-e project. The arrests come amid growing concern about cyber-related offences in Africa, with INTERPOL reporting that two-thirds of surveyed African countries now classify cybercrime as a medium to high proportion of all criminal activity. DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Cyber Crime Fraud Nigeria scam DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Tackling terrorism requires jobs and anti-corruption drive, not strikes alone – Nigerian security analyst Terror attacks in Nigeria affect all faiths, not only Christians – Security analyst US strikes on terrorists in Nigeria timely and strategic – Security analyst Lawyer arraigned over alleged GH¢800k excavator fraud Precision strikes hit terrorist targets as Nigeria, U.S. strengthen security cooperation Trump says US military struck ISIS terrorists in Nigeria Boko Haram suicide bomber behind Borno mosque blast in Nigeria, army says Five killed in Nigeria mosque attack, police say Bomb blast in packed Nigerian mosque kills five Nigeria adopts e-pharmacy 3 years after Ghana’s ground-breaking launch",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/SENTINEL-642x424.jpg"
  },
  {
    "url": "https://www.myjoyonline.com/dopenation-electrifies-crowd-at-joy-fms-party-in-the-park/",
    "title": "DopeNation electrifies crowd at Joy FM’s Party in the Park",
    "text": "Ghanaian musical duo DopeNation, made up of identical twin brothers, thrilled patrons at Joy FM’s Party in the Park with an energetic and captivating performance at the Aburi Botanical Gardens. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); The award-winning artistes mounted the stage to loud cheers from an enthusiastic crowd, instantly igniting the atmosphere with their signature blend of Afrobeats, hip-hop and high-energy rhythms. From the onset of their performance, patrons danced, sang along, and waved their hands in excitement as the duo delivered back-to-back hits. DopeNation’s commanding stage presence and seamless coordination kept the audience fully engaged throughout their set. Their ability to connect with fans, coupled with pulsating beats and catchy lyrics, transformed the serene gardens into a vibrant arena of celebration. googletag.cmd.push(function() { googletag.display('in-article'); }); Young patrons in particular responded enthusiastically, recording moments on their phones and joining in choruses, while families and older attendees also embraced the lively performance. The duo’s appearance added a youthful and contemporary flavour to the event’s diverse musical line-up. Joy FM’s Party in the Park is an annual family-oriented outdoor event designed to bring people together through music, recreation and social interaction. This year’s edition has continued to draw large crowds, with performances from top Ghanaian artistes contributing to the growing excitement. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); Set against the lush backdrop of the Aburi Botanical Gardens, DopeNation’s electrifying performance stood out as one of the highlights of the day. DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: DopeNation Joy FM Party in the Park 2025 Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Big Smiles, Bigger Bounces: Kids take over the fun at the Joy Party in the Park Patrons dance through drizzles at Joy FM’s Party in the Park 2025 Joy FM Party in the Park 2025: Shakers Royal Band ignites excitement Kwanpa Band thrills patrons as Joy FM Family Party in the Park DopeNation set to thrill patrons at Joy FM’s 2025 Family Party in the Park Mr Drew warns DopeNation over comments on ‘This Year’ songwriting credit DopeNation out with 3rd studio album GhanaPiano (The Album) DopeNation did not file for 2025 TGMA – Robert Klah Why DopeNation wants to hold free concert at Swedru Senior High School DopeNation out with new single ‘Gbohe’",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/image-2853-565x424.png"
  },
  {
    "url": "https://www.myjoyonline.com/this-saturday-on-newsfile-constitution-review-report-and-ags-oral-drive/",
    "title": "This Saturday on Newsfile: Constitution review report and AG’s ORAL drive",
    "text": "This Saturday on Newsfile, host Samson Lardy Anyenini and his panellists will discuss the Constitution Review Committee’s final report and the latest updates on the Operation Recover All Loot (ORAL), including high-profile cases. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); On Monday, December 22, the Constitution Review Committee submitted its final report to President John Dramani Mahama, marking a key step in Ghana’s constitutional reform process. Key recommendations include separating the legislature from the executive, reaffirming that there is no provision for a third presidential term, and extending the presidential term from four to five years. Also, this week, the Attorney-General and Minister of Justice, Dr Dominic Akuritinga Ayine, provided updates on ORAL. Among the cases highlighted, Bernard Antwi Boasiako, known as Chairman Wontumi, and directors of Wontumi Farms are expected to face charges over alleged state losses exceeding GH¢24 million. googletag.cmd.push(function() { googletag.display('in-article'); }); Investigations revealed that the company applied for a loan before registration, submitted forged documents, and failed to implement the project. Percival Kofi Akpaloo of the Liberal Party and associated entities will also face prosecution for allegedly diverting COCOBOD contract funds, including allegations of forgery. ORAL is a government-led initiative aimed at investigating corruption, misappropriation, and dissipation of state assets to recover public funds through criminal and civil processes. This special programme will provide an in-depth discussion of the CRC report, helping viewers understand both the process of constitutional review and the implications of the committee’s recommendations for Ghana’s democratic future. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); Newsfile airs live on JoyNews this Saturday from 8:00 am to noon on DStv channel 421, GOtv channel 144, and streams on JoyNews’ Facebook and YouTube platforms. Listeners can also follow on Joy 99.7 FM, Luv 99.5 FM, or via Google and Apple Podcasts. Newsfile is your most authoritative news analysis programme. DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Attorney General Constitution review Newsfile Oral Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story ORAL investigations are proceeding well – Attorney General AG vs Wontumi Farms: Full investigation outlined by the Attorney-General PwC nears completion of forensic audit on National Cathedral Project – AG Playback: Newsfile discussed Kpandai rerun halt, Ofori-Atta’s extradition fight, and Bawku Mediation Report Ofori-Atta extradition handled with dispatch, says Kpebu, blames OSP for delays Pending applications won’t halt Kpandai parliamentary rerun – Kwame Akuffo AG has constitutional authority over OSP, including power to enter nolle prosequi – Kwame Akuffo Playback: Newsfile discussed Kpandai rerun and OSP repeal bill The Kissi Agyebeng Removal Bid: A Look at the Numbers Playback: Newsfile discussed petitions against the OSP, EC heads, and 2025 WASSCE results",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/image-2764.png"
  },
  {
    "url": "https://www.myjoyonline.com/gun-amnesty-greater-accra-leads-in-weapons-surrendered/",
    "title": "Gun Amnesty: Greater Accra leads in weapons surrendered",
    "text": "The National Commission on Small Arms and Light Weapons (NACSA) has revealed that the Greater Accra Region is leading in the number of firearms surrendered under the ongoing Gun Amnesty Programme. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); Launched on December 1, the initiative allows individuals to voluntarily register or hand in unregistered or illegal firearms without fear of arrest, prosecution, or questioning. NACSA’s Executive Secretary Dr Bonaa disclosed this to the media on Friday, December 26, after a visit to the National Mosque in Accra. During the visit, he met with the National Chief Imam to raise awareness among the Muslim community about the programme, which concludes on January 15, 2026. “The Greater Accra Region is one of the areas where most of the weapons we have collected are coming from. It is currently leading in terms of arms surrendered under the amnesty programme, with the support of the security commanders,” Dr. Bonaa said. googletag.cmd.push(function() { googletag.display('in-article'); }); He added that the outreach to the Muslim community was motivated by the influence of the National Chief Imam, who he described as a key figure in fostering peace and social cohesion. He stated that the Chief Imam has agreed to serve as an ambassador for the Gun Amnesty Programme. “The Chief Imam is one of the pillars of peace in this country. He does not preach violence or disturbance. Even in difficult moments when people wanted to react violently on his behalf, he consistently called for restraint. That tells you the kind of authority and moral influence he has,” Dr. Bonaa noted. Dr Bonaa further explained that the Chief Imam welcomed the programme and promised to encourage members of the Muslim community to voluntarily surrender illegal firearms. Joining the delegation, Greater Accra Regional Police Commander, DCOP Duuti Tuaruka, reassured the public that individuals handing in their weapons under the amnesty would not be arrested. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); He urged anyone in possession of illegal firearms to take advantage of the programme and hand them over to the security agencies before it ends. DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Greater Accra gun amnesty Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Police Christmas special operation: 101 suspects arrested in Greater Accra Police receive plaudits for reducing ‘landguardism’ in parts of Greater Accra Greater Accra Regional Minister distributes streetlights to all 29 Assemblies Greater Accra Regional Minister presents streetlights to MMDAs TH4D Amputee Soccer Tour uncovers rising talents across Ghana Interior Ministry to announce nationwide gun amnesty – Adam Bonaa hints Greater Accra records 115 out of 140 investment projects in 2024 Disclaimer & Clarification: Setting the record straight on my comments during the 2025 Mid-Year Budget Debate Greater Accra: Ambulance shortage forces dispatchers to prioritise only critical cases Greater Accra public lands: Government to set up Commission of Inquiry",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/image-2891.png"
  },
  {
    "url": "https://www.myjoyonline.com/us-strikes-on-terrorists-in-nigeria-timely-and-strategic-security-analyst/",
    "title": "US strikes on terrorists in Nigeria timely and strategic – Security analyst",
    "text": "A Nigerian security analyst, Denis Amachree, has welcomed the recent United States military operation against terrorist groups in Nigeria, describing the intervention as timely, strategic and long overdue. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); Speaking on The Pulse on JoyNews on Thursday, Mr Amachree said the operation highlights the critical role of international cooperation in addressing Nigeria’s prolonged security challenges, noting that the US intervention is a “welcome idea”. He explained that Nigeria has battled terrorism and insurgency for more than a decade without being able to fully eliminate the threat on its own, stressing that sustained external support is essential. “You know that Nigeria has been fighting insurgency of terrorism for the past 16 years, and we have not had any go about it. Now you will find out that fighting terrorism, you cannot fight it yourself; you really need international support. So I think we have been asking for this and we have been looking for weapons,” he said. According to Mr Amachree, support from strategic partners such as the United States is crucial to strengthening Nigeria’s counter-terrorism capacity and boosting its operational effectiveness. googletag.cmd.push(function() { googletag.display('in-article'); }); He added that the US military action also sends a strong message to terrorist groups operating in the region, warning that further action could follow. “I think it is strategic enough and it is a warning because there will be more strikes coming up,” he stated. On Thursday, former US President Donald Trump announced that he had ordered the US military to carry out what he described as “powerful and deadly” strikes against targets of the Islamic State (IS or ISIS) group in northwestern Nigeria. The strikes follow months of threats by Mr Trump to take military action against what he termed an “existential threat” to Christianity in Nigeria — a claim the Nigerian government has consistently rejected. The announcement was made in a post on the US Department of War’s X page. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); Mr Amachree believes the intervention reinforces global resolve to confront extremism and could mark a turning point in regional efforts to weaken terrorist networks operating across West Africa. DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Military Nigeria Terrorist USA Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Ghana-Nigeria cyber-fraud network dupes over 200 victims of $400,000 Tackling terrorism requires jobs and anti-corruption drive, not strikes alone – Nigerian security analyst Terror attacks in Nigeria affect all faiths, not only Christians – Security analyst Precision strikes hit terrorist targets as Nigeria, U.S. strengthen security cooperation Trump says US military struck ISIS terrorists in Nigeria Boko Haram suicide bomber behind Borno mosque blast in Nigeria, army says Five killed in Nigeria mosque attack, police say Bomb blast in packed Nigerian mosque kills five Nigeria adopts e-pharmacy 3 years after Ghana’s ground-breaking launch Superb Ademola strike helps Nigeria overcome Tanzania",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/WhatsApp-Image-2025-12-26-at-3.22.09-PM-754x424.jpeg"
  },
  {
    "url": "https://www.myjoyonline.com/police-christmas-special-operation-101-suspects-arrested-in-greater-accra/",
    "title": "Police Christmas special operation: 101 suspects arrested in Greater Accra",
    "text": "As part of efforts to ensure a safe and peaceful festive season, the Greater Accra Regional Police Command has arrested 101 suspects during targeted operations at Kwame Nkrumah Circle, Nungua, Adabraka, Achimota, East Legon, and Railways. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); The operations form part of the police command’s intensified measures to maintain law and order and reduce criminal activities during the Christmas period. DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Greater Accra Police Christmas special operation Suspects Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Gun Amnesty: Greater Accra leads in weapons surrendered Police Christmas special operation: 27 suspects rounded up in Savannah Region Police receive plaudits for reducing ‘landguardism’ in parts of Greater Accra People were leaking information to fraud suspects – Sam George on past failed cybercrime arrests Greater Accra Regional Minister distributes streetlights to all 29 Assemblies Greater Accra Regional Minister presents streetlights to MMDAs TH4D Amputee Soccer Tour uncovers rising talents across Ghana Tarkwa: Police arrest suspects seen in video abusing two women Robbery suspect slips through police grip during washroom break at Weija Police Station 2 suspects in SML case sue OSP over photographs",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/image-2888.png"
  },
  {
    "url": "https://www.myjoyonline.com/joy-fm-party-in-the-park-2025-kwabena-kwabena-takes-centre-stage/",
    "title": "Joy FM Party in the Park 2025: Kwabena Kwabena takes centre stage",
    "text": "Highlife star Kwabena Kwabena has mounted the stage at Joy FM’s Party in the Park, sending waves of excitement through the crowd gathered at the Aburi Botanical Gardens. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); The celebrated musician, known for his soulful voice and timeless highlife hits, was met with loud cheers as he made his appearance, instantly lifting the energy of the event. From the opening notes of his performance, patrons sang along and danced enthusiastically, drawn in by his captivating stage presence and rich musical delivery. Kwabena Kwabena’s set featured a blend of classic favourites and well-loved melodies that have earned him a loyal following over the years. Despite earlier drizzles, the crowd remained fully engaged, dancing and waving as the music echoed through the scenic surroundings of the botanical gardens. googletag.cmd.push(function() { googletag.display('in-article'); }); The live performance further cemented the festive mood that has characterised this year’s edition of the event. Joy FM’s Party in the Park is an annual family-oriented outdoor celebration that brings together music lovers, families and revellers in a relaxed and refreshing environment. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Joy FM Party In The Park Kwabena Kwabena Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Joy FM Party in the Park kicks off as patrons flock in amid growing excitement Joy FM Party in the Park kicks off today at Aburi Botanical Gardens A Drizzle of Romance: Kwabena Kwabena’s love songs shine through in Takoradi anniversary spectacle Kwabena Kwabena chooses Stonebwoy and Kofi Kinaata for ‘Asor’ Remix Kwabena Kwabena mourns Daddy Lumba: “We’ve lost a great treasure” Kwabena Kwabena to feature all-star lineup on ‘Asor’ remix for 20th anniversary Kwabena Kwabena launches ‘Aso @ 20’ with global tour and remix plans I was depressed at a point in my life – Kwabena Kwabena There’s an agenda from gospel fraternity not to push my EP – Kwabena Kwabena I was disrespected by a gospel artiste for trying to make a gospel EP – Kwabena Kwabena",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/image-2830-636x424.png"
  },
  {
    "url": "https://www.myjoyonline.com/au-flatly-rejects-somaliland-bid-reaffirms-somalias-unity/",
    "title": "AU flatly rejects Somaliland bid, reaffirms Somalia’s unity",
    "text": "The Chairperson of the African Union Commission, Mahmoud Ali Youssouf, has firmly rejected any attempt to recognise Somaliland as an independent state. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); He restated that the African Union’s unwavering commitment is to the unity, sovereignty and territorial integrity of Somalia. In a press release issued on December 26, the AU Commission Chair said he had taken note, with deep concern, of recent developments relating to Somaliland, warning that any move to recognise it would violate core principles of the continental body. Mr Youssouf reaffirmed the African Union’s long-standing and consistent position, which is rooted in the Constitutive Act of the African Union, particularly the principle of respecting borders inherited at independence. He recalled the 1964 decision of the Organisation of African Unity, which affirmed the inviolability of Africa’s colonial borders as a foundation for peace and stability on the continent. googletag.cmd.push(function() { googletag.display('in-article'); }); The AU Commission Chair stressed that Somaliland remains an integral part of the Federal Republic of Somalia and said any initiative aimed at recognising it as an independent entity is firmly rejected by the African Union. According to him, efforts to undermine Somalia’s unity, sovereignty and territorial integrity run directly against the fundamental principles of the African Union. He warned that such actions also risk setting a dangerous precedent with far-reaching consequences for peace, security and stability across Africa. Mr Youssouf reiterated the African Union’s full and unwavering support for Somalia, including ongoing efforts by Somali authorities to consolidate peace, strengthen state institutions and advance inclusive governance. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); The statement underscores the African Union’s position that Africa’s stability depends on respect for sovereignty and territorial integrity, and that any unilateral moves threatening these principles will not be supported by the continental body. DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: African Union Somaliland Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story ECOWAS Council of Ministers endorses President Mahama’s candidacy for 2027 AU Chair role African Union, ECOWAS, and West African Elders condemn coup in Guinea-Bissau following elections Africon AI partners African Union to boost financial innovation through Artificial Intelligence The African Economic Index: Concept, method, and a practical adoption pathway for AU African Union urges adoption of world map showing continent’s true size Fatal Helicopter Crash: African Union expresses deep condolences African Union agency says Fitch’s downgrade of Afreximbank is ‘flawed’ Rising populism should not stop discussions on reparations, says African Union official Morocco reaffirms commitment to Africa’s peace, security, and development at AU Summit Algeria’s controversial victory in African Union Commission’s Vice-Presidency race",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/01/image-973-674x424.png"
  },
  {
    "url": "https://www.myjoyonline.com/patrons-dance-through-drizzles-at-joy-fms-party-in-the-park-2025/",
    "title": "Patrons dance through drizzles at Joy FM’s Party in the Park 2025",
    "text": "Despite intermittent drizzles, the festive atmosphere at Joy FM’s Party in the Park 2025 has remained undiminished, as patrons continue to dance enthusiastically at the Aburi Botanical Gardens. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); The light rainfall, which occasionally swept across the venue, did little to dampen the spirits of the crowd. Instead, revellers embraced the moment, dancing off their feet to live music and entertainment, turning the gardens into a vibrant hub of joy and celebration. Families, young adults and music lovers could be seen swaying, singing along and cheering as performances carried on uninterrupted. Some patrons gathered trees, while others danced freely in the open, clearly determined not to let the weather stand in the way of their enjoyment. googletag.cmd.push(function() { googletag.display('in-article'); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Joy FM Party in the Park 2025 DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story DopeNation electrifies crowd at Joy FM’s Party in the Park Big Smiles, Bigger Bounces: Kids take over the fun at the Joy Party in the Park Joy FM Party in the Park 2025: Shakers Royal Band ignites excitement Kwanpa Band thrills patrons as Joy FM Family Party in the Park",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/image-2806-565x424.png"
  },
  {
    "url": "https://www.myjoyonline.com/big-smiles-bigger-bounces-kids-take-over-the-fun-at-the-joy-party-in-the-park/",
    "title": "Big Smiles, Bigger Bounces: Kids take over the fun at the Joy Party in the Park",
    "text": "Laughter echoed across the park as kids bounced, jumped, and played during the Joy FM Party at the Park, with the bouncing castles quickly becoming the main attraction for the young ones. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); Children lined up excitedly for their turn on the colourful inflatable castles, where they leapt into the air, tumbled with friends, and burned off energy under the watchful eyes of parents and volunteers. The bounce area stayed busy throughout the event, filled with smiles and nonstop motion. It spilt into laughter on grass-stained clothes, tired legs and faces lit with unfiltered excitement. As families streamed into the gardens for Joy FM’s Family Party in the Park, children quickly claimed the space in ways only they can, running freely, chasing games, tugging at parents’ hands and turning the wide green landscape into a playground of their own making. googletag.cmd.push(function() { googletag.display('in-article'); }); Away from the wrapped gifts and indoor routines of Christmas Day, the park offered something simpler: room to move. Children darted between activity points, queued impatiently for games, and ate with their families. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Joy FM Party in the Park 2025 Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story DopeNation electrifies crowd at Joy FM’s Party in the Park Patrons dance through drizzles at Joy FM’s Party in the Park 2025 Joy FM Party in the Park 2025: Shakers Royal Band ignites excitement Kwanpa Band thrills patrons as Joy FM Family Party in the Park",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/image-2792-565x424.png"
  },
  {
    "url": "https://www.myjoyonline.com/100-arrested-in-accras-tabora-in-major-mobile-money-fraud-crackdown/",
    "title": "100 arrested in Accra’s Tabora in major Mobile Money fraud crackdown",
    "text": "The Minister for Communications and Digital Innovation, Samuel Nartey George, has praised a major police-led operation that led to the arrest of 100 suspects in Tabora, a suburb of Accra, over alleged involvement in Mobile Money (MoMo) fraud and other cyber-enabled financial crimes. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); The coordinated operation, carried out in the early hours of Friday, December 27, involved the Cyber Security Authority (CSA), the Ghana Police Service, National Security, and the Ghana Immigration Service. According to the Minister, preliminary investigations indicate that the majority of the suspects are Nigerian nationals. Security agencies also seized 38 laptops and 150 mobile phones believed to have been used in committing the offences. The suspected crimes include MoMo fraud, romance scams, sextortion, Business Email Compromise (BEC), and wire fraud. A Ghanaian landlord was also arrested for allegedly accommodating about 100 of the suspects in his residence. googletag.cmd.push(function() { googletag.display('in-article'); }); “This operation demonstrates our commitment to protecting Ghanaians and the business environment from cybercrime. Landlords and property owners must ensure their premises are not used to facilitate illegal activity,” the Minister noted. He added that forensic analysis of the seized devices is ongoing, and suspects found culpable will be prosecuted under Ghanaian law. Mr George also urged the public to remain vigilant and report suspicious online activities, while reassuring investors and residents that Ghana remains open to lawful business. “We welcome legitimate enterprise, but anyone attempting cybercrime in Ghana will be found, arrested, and dealt with decisively,” he stated. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Fraud Mobile Money Samuel Nartey George Tabora Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Sam George lauds coordinated crackdown on cybercrime in Tabora and Lashibi Ghana-Nigeria cyber-fraud network dupes over 200 victims of $400,000 Lawyer arraigned over alleged GH¢800k excavator fraud Cybercrime crackdown: 48 suspects arrested in Dawhenya operation Britain’s worst romance fraudster’ who scammed single mothers out of £1m is jailed for 17 years Ghana recovers over $15m from international crypto fraud syndicate – Attorney General MTN Mobile Money to undergo nationwide agent re-registration in 2026 to curb fraud People were leaking information to fraud suspects – Sam George on past failed cybercrime arrests Hubtel named Overall Best Fintech Partner at 2025 Fintech Stakeholder Dinner & Awards Mobile money transactions hits GH¢3trn as digital payments surge – BoG Report",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/4-7-580x424.jpeg"
  },
  {
    "url": "https://www.myjoyonline.com/ndc-cant-change-the-constitution-alone-minority-mps-hold-key-role-says-barker-vormawor/",
    "title": "NDC can’t change the constitution alone – Minority MPs hold key role, says Barker-Vormawor",
    "text": "Convener of the FixTheCountry Movement, Oliver Barker-Vormawor, has observed that the legal process required to amend recommendations by the Constitution Review Committee (CRC) could significantly enhance the influence of the minority in Parliament. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); Speaking on the constitutional reform debate on JoyNews' Newsfile on Saturday, December 27, Barker-Vormawor explained that any attempt to amend the Constitution would require the support of at least 75 percent of Members of Parliament. He noted that this high threshold effectively prevents a single political bloc from unilaterally driving changes. “Every conversation, every discussion must go through Parliament… so as far as this is concerned, once the people approve, all discussions, all changes go through Parliament. It is just a different threshold within Parliament. In my opinion, this is what makes the minority very powerful, irrespective of how small they are,” he said. Read also: Playback: Newsfile discussed Constitution review report and AG’s ORAL drive googletag.cmd.push(function() { googletag.display('in-article'); }); According to Barker-Vormawor, even with a parliamentary majority, the National Democratic Congress (NDC) would be unable to meet the constitutional requirement alone, thereby compelling broader consensus and negotiation across the aisle. “There is no way you can be able to meet the threshold that is required for the amendments without the minority being part of it. Meaning that there is no way the NDC can run and say we are changing everything without them (Minority),” he explained. His comments come as national attention intensifies around the CRC’s recommendations, with stakeholders assessing both the substance of the proposals and the political arithmetic required to translate them into law. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Constitution review NDC NPP Oliver Barker Vormawor Parliament Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Let’s prove our readiness power through deeds, not words – Afenyo-Markin to NPP faithful This Saturday on Newsfile: Constitution review report and AG’s ORAL drive Afenyo-Markin urges NPP to move from talk to action after 2024 election loss Afenyo-Markin urges discipline, unity as NPP prepares for 2026 flagbearer primary Ashanti Regional Council of Elders commends NPP minority caucus for parliamentary resilience NPP Chairman aspirant John Boadu vows to rebuild party in Christmas message NDC highlights first year achievements, vows to stabilise economy and strengthen governance 2024 defeat revealed governance and candidate failures — Bryan Acheampong One year on, NDC recounts its mandate and promises results in Christmas message No room for excuses – NDC vows to deliver fully on people’s mandate",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/WhatsApp-Image-2025-12-27-at-1.22.28-PM-754x424.jpeg"
  },
  {
    "url": "https://www.myjoyonline.com/tema-oil-refinery-resumes-crude-refining-after-years-of-shutdown/",
    "title": "Tema Oil Refinery resumes crude refining after years of shutdown",
    "text": "The Tema Oil Refinery (TOR) has officially resumed crude oil refining operations after several years of inactivity. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); The resumption follows the successful completion of major Turnaround Maintenance (TAM) works on the refinery’s Crude Distillation Unit (CDU), carried out between August 1 and October 30. The maintenance exercise, completed within three months, was undertaken in line with international engineering, safety, and operational standards, the Managing Director of TOR, Edmond Kombat, disclosed on Facebook. After the maintenance works, the National Petroleum Authority (NPA) conducted comprehensive regulatory inspections and confirmed that TOR met all mandatory safety and operational requirements. The authority has since granted clearance for the refinery to recommence refining activities. In a statement issued on Saturday, TOR explained that refining operations will initially proceed under a phased approach, ahead of the refinery’s formal recommissioning. This period, the company said, will allow for system stabilisation, performance optimisation and the assurance of sustained operational reliability. googletag.cmd.push(function() { googletag.display('in-article'); }); As part of its upgrade programme, TOR has also completed the installation of a new furnace, F-61, which is expected to be commissioned and integrated into the CDU in the coming months. The installation is projected to restore the refinery’s original nameplate capacity of 45,000 barrels per stream day, up from the current operating level of 28,000 barrels per stream day. Management further outlined a strategic plan to expand capacity to 60,000 barrels per stream day in the medium term, following the installation of a new air cooler. The Government of Ghana is expected to formally commission and tie in the F-61 furnace at a later date, with details of the event to be communicated in due course. TOR expressed appreciation to President John Dramani Mahama for what it described as his continued support and leadership in restoring the refinery as a key component of Ghana’s energy infrastructure. The refinery also acknowledged the role of the Minister for Energy and Green Transition, Dr John Abdulai Jinapor, citing his technical oversight and policy leadership as instrumental to the revival process. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); Commending its board, management and workforce, TOR praised the staff’s resilience and professionalism throughout the restoration journey. The company reaffirmed its commitment to safe, efficient, and sustainable operations as it seeks to reclaim its position as a cornerstone of Ghana’s energy sector. DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Crude Oil Tema Oil Refenery Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Ghana records $5.57bn trade surplus in first-half of 2025 Ghana saves $1.4bn since commercial export of crude oil Ghana bagged $370.62m from crude oil in first-half of 2025 New board inaugurated to revitalise Tema Oil Refinery 14 Years of production: Ghanaians see oil as neither blessing nor curse — Research Oil prices fall slightly, but Ghana still at risk as Israel–Iran conflict continues Crude oil production declined for the 5th consecutive year in 2024 – PIAC report Two Nigerian businessmen in court over alleged $20,000 fraud Ghana’s gross reserves end December 2024 at US$8.98bn; trade balance records surplus of $US4.98bn Fuel prices to go down from tomorrow November 16, 2024 – COPEC",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/image-2973.png"
  },
  {
    "url": "https://www.myjoyonline.com/mahamas-record-shows-four-year-presidential-term-is-sufficient-inusah-fuseini/",
    "title": "Mahama’s record shows four-year presidential term is sufficient – Inusah Fuseini",
    "text": "Former Member of Parliament for Tamale Central, Inusah Fuseini, has questioned the need to extend Ghana’s presidential term from four to five years, arguing that President John Dramani Mahama’s performance demonstrates that effective governance is possible within the existing constitutional framework. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); Mr Fuseini made the remarks on Newsfile on JoyNews on Saturday, December 27, while commenting on proposals by the Constitution Review Committee (CRC) to amend aspects of the 1992 Constitution. His comments follow the submission of the CRC’s report to President Mahama on Monday, December 22, a major milestone in Ghana’s ongoing constitutional review process. Among the key proposals in the report are the separation of the legislature from the executive, a reaffirmation that the Constitution does not permit a third presidential term, and an extension of the presidential term of office. While acknowledging the work of the CRC, Mr Fuseini said he remains unconvinced about the need for a longer presidential term, noting that the idea has resurfaced periodically in Ghana’s political discourse. “I have reservations. My first reservation is that I am not entirely convinced that we need to extend the term of the presidency,” he said. googletag.cmd.push(function() { googletag.display('in-article'); }); He traced the origins of the proposal to January 5, 2009, when former President John Agyekum Kufuor, in his final State of the Nation Address, cited examples from Singapore and Malaysia to argue that longer terms of governance may have contributed to their development. “This suggestion is not new. The first time it entered our national discourse was on 5 January 2009, when His Excellency John Agyekum Kufuor delivered his final State of the Nation Address to Parliament. He cited Singapore and Malaysia and the duration of governance that probably aided the growth and development of their countries,” Mr Fuseini said. According to him, Ghana’s four-year term already provides adequate time for accountability and policy delivery, pointing to President Mahama’s current administration as evidence. “And John Dramani Mahama has demonstrated that, clearly in this term of his presidency,” he said. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); “He has shown that you can set up your government in less than three months and get it running. In fact, he has also shown that you can achieve significant success in the first year of government. That goes to dispel what President Kufuor said in 2009.” Mr Fuseini maintained that the President’s performance so far weakens the argument for extending the presidential term, stressing that decisive leadership and measurable progress can be achieved within the existing four-year mandate. The CRC presented a summary of its findings to the President, with the full and final report expected to be made public in January. googletag.cmd.push(function() { googletag.display('in-article2'); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: CRC Report Inusah Fuseini Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Four-year term enough for accountability – Inusah Fuseini Matthew Nyindam will only be reinstated as MP If … – Inusah Fuseini Move to scrap OSP is premature, Inusah Fuseini tells Majority caucus Afenyo-Markin has scandalised himself and his profession – Fuseini slams ‘paymasters’ comment Wesley Girls’ case: Inusah Fuseini links current education tensions to colonial legacy No MP is untouchable, says Inusah Fuseini as Afenyo-Markin faces privileges probe Inusah Fuseini accuses Ofori-Atta of dodging accountability as extradition efforts intensify CJ vetting: How do Minority intend to win two-thirds of votes if their intention isn’t to bring Torkornoo’s case? – Inusah Fuseini Minority’s move to halt CJ vetting misplaced – Inusah Fuseini Inusah Fuseini praises Mahama for acting on institutional advice, not dictatorship",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/Screenshot-48-754x424.png"
  },
  {
    "url": "https://www.myjoyonline.com/one-year-extension-of-presidential-term-unnecessary-baffuor-awuah/",
    "title": "One-year extension of presidential term unnecessary – Baffuor Awuah",
    "text": "Vice Chair of Parliament’s Subsidiary Legislation Committee and a member of the Constitutional and Legal Affairs Committee, Nana Agyei Baffuor Awuah, has described the Constitution Review Committee’s (CRC) proposal to extend the presidential term from four to five years as unnecessary. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); He made the comments on Newsfile on JoyNews on Saturday, December 27. His remarks follow the submission of the CRC’s final report to President John Dramani Mahama on Monday, December 22. The report contains several key recommendations, including the separation of the legislature from the executive, a reaffirmation that the Constitution does not allow a third presidential term, and a proposal to extend the presidential term of office from four to five years. The CRC has so far presented a summary of its findings to the President, with the full and final report expected to be made public in January. googletag.cmd.push(function() { googletag.display('in-article'); }); Speaking on the programme, Mr Baffuor Awuah stressed the need for a thorough comparative analysis of the CRC’s proposals against earlier constitutional review efforts, particularly the report of the Professor Fiadjo Committee. “When you look at the Fiadjo Commission’s report on the tenure of the president, they conducted a historical analysis of where the four years came from,” he explained. “The Consultative Assembly initially preferred five years, the Commission of Experts recommended four, and the Powers of Government Committee opted for five. After careful evaluation, they settled on four years.” He questioned the rationale behind the proposed extension, arguing that the justification for giving presidents more time to complete projects is largely impractical. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); “The fundamental question is: what mischief are we seeking to cure with this proposed extension? The so-called ‘mischief’ is about giving the president time to finish his work, but practically, no president can complete everything during his tenure,” he said. Mr Baffuor Awuah noted that presidents routinely initiate projects, contract loans, and pass legislation whose full impact often extends beyond their time in office. Extending the term by just one year, he argued, would not change that reality. “The issue really has to do with continuity. We should focus on passing laws or mechanisms that ensure continuity, rather than simply extending the president’s term,” he said. googletag.cmd.push(function() { googletag.display('in-article2'); }); “Adding one more year will not enable the president to finish everything he starts. We need to look at how best we can achieve continuity effectively.” DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Nana Agyei Baffuor Awuah presidential tenure Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story I don’t believe OSP will disregard proper discretion – Lawyer on Charles Bissue’s arrest warrant",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/Screenshot-56-754x424.png"
  },
  {
    "url": "https://www.myjoyonline.com/dr-nyaho-nyaho-tamakloe-opposes-presidential-term-extension/",
    "title": "Dr Nyaho Nyaho-Tamakloe opposes presidential term extension",
    "text": "Veteran Ghanaian statesman Dr Nyaho Nyaho-Tamakloe has strongly opposed proposals to extend Ghana’s presidential term, insisting that the existing two four-year terms are sufficient for effective governance. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); In a statement released this week regarding the ongoing constitutional review, Dr Nyaho-Tamakloe argued that “four years is adequate time for a serious and prepared government to make its mark,” adding that “arguments suggesting a need for additional time only create unnecessary opportunities for inefficiency and corruption.” The former diplomat stressed that while continuity in governance is important, it should not be used as justification for lengthening presidential tenure. “Unfinished national projects must be continued by successive governments. The practice of abandoning ongoing projects in order to initiate new ones has become a major source of waste and corruption,” he said. Read Also: Dr Nyaho Nyaho-Tamakloe: On Ghana’s constitution review and the future of democratic governance Dr Nyaho-Tamakloe also called for a review of provisions that grant excessive immunity and lifelong benefits to public office holders. “The Constitution contains numerous clauses that effectively shield the President during and even after his tenure in office. These protections make it nearly impossible to hold a President fully accountable under the law. This situation is no longer tenable in a mature democracy,” he noted. He further added that “the system of ex gratia payments and excessive post-office benefits for public office holders must be abolished,” urging that these resources be redirected to improve the lives of ordinary Ghanaians. googletag.cmd.push(function() { googletag.display('in-article'); }); On the structure of government, he supported reforms aimed at strengthening accountability, including appointing ministers strictly from outside Parliament to ensure a clear separation between the Executive and Legislature. “Parliament must be empowered to independently scrutinise government actions without conflict of interest,” he said. Addressing leadership qualifications, Dr Nyaho-Tamakloe emphasised that the presidency requires maturity and experience. “The minimum age requirement for presidential candidates should be reviewed upward to reflect the seriousness and responsibility of the office,” he said. The statesman concluded by calling on all stakeholders to approach the constitutional review process with integrity and a focus on national interest. “Constitutional reform must not be driven by partisan interests but by the collective good of the nation,” he urged, highlighting the need for accountability, discipline, and responsible governance. Dr. Nyaho-Tamakloe’s statement comes ahead of the expected release of the full report of the Constitution Review Committee, which is scheduled for January 2026. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Constitution Review Committee Dr Nyaho Nyaho-Tamakloe presidential term extension Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Dr Nyaho Nyaho-Tamakloe calls for abolition of ex gratia payments, excessive benefits for public officeholders Dr Nyaho Nyaho-Tamakloe backs review of presidential immunity provisions in Ghana’s constitution Dr Nyaho Nyaho-Tamakloe: On Ghana’s constitution review and the future of democratic governance Why Ghana’s Constitution Review Committee’s Work Should Be Extended to Strategic Communication How presidential control has weakened Council of State – Prof H. Kwasi Prempeh explains A second look, not a veto – Constitution Review Chair makes case for Council of State reform Too young to lead? – Prof H. Kwasi Prempeh says Ghana’s Constitution undervalues its youth Let the people decide – Constitution Review Chair pushes back against fear of ‘young presidents’ Selective justice is destroying trust in Ghana’s anti-corruption system – Prof H. Kwasi Prempeh Ghana’s democratic debate is too insular and afraid of change – Constitution Review Chair",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2024/12/nyaho-636x424.jpg"
  },
  {
    "url": "https://www.myjoyonline.com/prof-prempeh-defends-lowering-presidential-age-cites-kufuors-early-leadership-roles/",
    "title": "Prof. Prempeh defends lowering presidential age, cites Kufuor’s early leadership roles",
    "text": "Professor Henry Kwasi Prempeh, Chairman of the Constitution Review Committee (CRC), has defended the committee’s recommendation to reduce the minimum age for presidential candidates to 30, responding to concerns that the proposal could allow inexperienced individuals to assume the nation’s highest office. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); Speaking on the historical context, Prof. Prempeh noted that former President John Kufuor held significant leadership roles at a much younger age. “In 1969, we had a ceremonial president, and I think the age was 40 or higher, but real power was with the Prime Minister and the Cabinet. To get into Cabinet, you had to come from Parliament, and the minimum age at the time was 21. \"So when former President Kufuor became a Deputy Minister, he was 21—not even 30—because the constitution allowed you to enter Parliament at 21, from where you could be picked as a Cabinet Minister or even Prime Minister,” he explained. Prof. Prempeh stressed that the committee’s proposal aims to expand political participation and give young Ghanaians more opportunities to engage in leadership. googletag.cmd.push(function() { googletag.display('in-article'); }); He argued that age alone should not determine leadership capacity, pointing to historical examples where young leaders effectively contributed to governance. He urged the public to view the recommendation within the broader context of constitutional reform, which seeks to modernise Ghana’s governance structures and reflect the aspirations of a youthful population. According to him, lowering the presidential age is part of making the political system more inclusive and forward-looking. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Kufuor Prof. Prempeh Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Celebrating Kufuor at 87: Arthur Kennedy hails statesman’s legacy Kufuor says some NPP members wanted him out after his 39% showing in the 1996 election I appointed my brother as Defence Minister because I knew he could deliver – Kufuor justifies Alan Kyerematen rejected my offer to serve as minister in 2000 – Kufuor reveals ‘I never backed Alan Kyerematen against Akufo-Addo’ – Kufuor clears air on old rumours NPP’s 2024 loss a wake-up call on governance and accountability – Kufuor Edudzi Tameklo pays courtesy call on fmr. President Kufuor ahead of NPA @20 celebrations Abronye did not disrespect Kufuor at NPP meeting — Acting National Chairman clarifies Kufuor hails Apostle Safo Kantanka as ‘a grace and a gift’ to Africa Kufuor calls for second chamber of Parliament to vet key appointments",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/HK-Prempeh-833x424-1.jpg"
  },
  {
    "url": "https://www.myjoyonline.com/at-30-you-lack-the-experience-to-be-a-president-prof-agyeman-duah/",
    "title": "At 30, you lack the experience to be a President – Prof Agyeman-Duah",
    "text": "Former UN Senior Governance Advisor, Prof Kwaku Agyeman-Duah, has opposed proposals to reduce the minimum age requirement for presidential candidates from 40 to 30 years, arguing that the office demands a level of maturity and experience that most people at 30 are unlikely to have attained. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); He made the comments on Newsfile on JoyNews on Saturday, December 27, during discussions on the ongoing constitutional review being undertaken by the Constitution Review Committee (CRC). The Chairman of the CRC, Professor H. Kwasi Prempeh, has indicated that the Committee is recommending an amendment to Article 62(b) of the 1992 Constitution to lower the minimum age for contesting the presidency from 40 to 30 years. However, Prof Agyeman-Duah questioned the basis for the proposed amendment, stressing that leadership at the level of the presidency requires substantial exposure, maturity and practical experience. “Personally, I didn't like the idea of reducing the age from 40 to 30 because I think that at 30 years you don't have enough maturity. Pardon me for those who think I am wrong,” he said. googletag.cmd.push(function() { googletag.display('in-article'); }); He added that the Ghanaian socio-economic context makes it even more difficult for young people to acquire the depth of experience required to govern effectively by that age. “I think if you take the Ghanaian context into account, for instance, most Ghanaians from the villages, as I come from, by the time you finish your first degree, you are almost 27 or 28, and even if by then you have finished your master's degree, what experience do you have, what exposure have you had to run the country? because running the country is not running NUGS organisations,” he explained. Prof Agyeman-Duah further emphasised that age often brings perspective and judgement that are essential for state leadership. “At my age, I know that 30 years simple, you haven't attained the age of maturity to run a state,” he stated. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); The CRC recently presented its constitutional review report to the President as part of its mandate to examine and propose reforms to the 1992 Constitution. Several of the Committee’s recommendations, including the proposed reduction in the presidential age threshold, have since sparked widespread public debate. Read also: Constitutional Review Committee proposes lowering presidential age limit from 40 to 30 DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Constitution CRC Prof Agyeman-Duah Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Barker-Vormawor urges President Mahama to lead constitutional reform implementation MP Baffour Awuah advocates for legal framework on presidential continuity, not term extension Ghanaians entitled to propose constitutional changes – Charlotte Osei Four-year term enough for accountability – Inusah Fuseini CRC Proposals: We were very mindful not to create problems while solving existing ones – Charlotte Osei Charlotte Osei describes CRC work as “a privilege of a lifetime” Ablakwa inaugurates SMART classrooms for STEM education Constitution review was inclusive, structured and effective – Prof Prempeh NPP sets up joint committee to review Constitution Review Committee proposals Constitutional Review Committee proposes lowering presidential age limit from 40 to 30",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/WhatsApp-Image-2025-12-27-at-9.51.26-AM-754x424.jpeg"
  },
  {
    "url": "https://www.myjoyonline.com/dr-nyaho-nyaho-tamakloe-on-ghanas-constitution-review-and-the-future-of-democratic-governance/",
    "title": "Dr Nyaho Nyaho-Tamakloe: On Ghana’s constitution review and the future of democratic governance",
    "text": "I have followed the ongoing discussions on constitutional review in Ghana with keen interest and a deep sense of responsibility to the nation. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); It is important for Ghanaians to understand that the 1992 Constitution was born out of a delicate historical compromise. Its framing was influenced by the transition from military rule to civilian democratic governance. I wish to acknowledge the critical role played by Justice D. F. Annan, former Judge of the Superior Courts and Speaker of Parliament, whose initiative and counsel helped persuade Flight Lieutenant Jerry John Rawlings to finally accept a return to constitutional rule. That compromise, however necessary at the time, has left us with a Constitution that overprotects the Office of the President. The Constitution contains numerous clauses that effectively shield the President during and even after his tenure in office. These protections make it nearly impossible to hold a President fully accountable under the law. This situation is no longer tenable in a mature democracy. The President is responsible to the people, and where wrongdoing occurs, the President must be subject to the law like every other citizen. Excessive immunity provisions must therefore be reviewed and removed. On the matter of presidential tenure, I state without hesitation that there must be no extension of the current term limits. The existing arrangement of two four-year terms is sufficient and must remain unchanged. Four years is adequate time for a serious and prepared government to make its mark. Governance is a continuum, and any responsible political party must be ready to govern from the first day in office. Arguments suggesting a need for additional time only create unnecessary opportunities for inefficiency and corruption. I also wish to emphasize that unfinished national projects must be continued by successive governments. The practice of abandoning ongoing projects in order to initiate new ones has become a major source of waste and corruption. While continuity may not necessarily be entrenched as a constitutional provision, it must become a binding principle of responsible governance. googletag.cmd.push(function() { googletag.display('in-article'); }); Furthermore, the system of ex-gratia payments and excessive post-office benefits for public office holders must be abolished. Public servants are already compensated through their salaries. There is no justification for lifelong benefits, state-funded housing, or undue privileges. These resources should instead be redirected towards improving the living conditions of ordinary Ghanaians. I fully support proposals to appoint Ministers strictly from outside Parliament. A clear separation between the Executive and the Legislature is essential for effective oversight and accountability. Parliament must be empowered to independently scrutinize government actions without conflict of interest. Finally, I believe that leadership of the nation requires maturity and experience. The minimum age requirement for presidential candidates should be reviewed upward to reflect the seriousness and responsibility of the office. Constitutional reform must not be driven by partisan interests but by the collective good of the nation. Ghana has reached a stage in its democratic journey where accountability, discipline, and national interest must take precedence over political convenience. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); I urge all stakeholders to approach this constitutional review process with honesty, courage, and a genuine commitment to the future of Ghana. SignedDr. Nyaho Nyaho-Tamakloe googletag.cmd.push(function() { googletag.display('in-article2'); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Constitution Review Committee Dr Nyaho Nyaho Tamakloe Advertisement DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Dr Nyaho Nyaho-Tamakloe backs review of presidential immunity provisions in Ghana’s constitution Dr Nyaho Nyaho-Tamakloe opposes presidential term extension Why Ghana’s Constitution Review Committee’s Work Should Be Extended to Strategic Communication How presidential control has weakened Council of State – Prof H. Kwasi Prempeh explains A second look, not a veto – Constitution Review Chair makes case for Council of State reform Too young to lead? – Prof H. Kwasi Prempeh says Ghana’s Constitution undervalues its youth Let the people decide – Constitution Review Chair pushes back against fear of ‘young presidents’ Selective justice is destroying trust in Ghana’s anti-corruption system – Prof H. Kwasi Prempeh Ghana’s democratic debate is too insular and afraid of change – Constitution Review Chair 24/7 campaigning is a choice, not democracy – Constitution Review Chair",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2024/03/Dr-Nyaho-Nyaho-Tamakloe.jpg"
  },
  {
    "url": "https://www.myjoyonline.com/three-suspected-armed-robbers-shot-dead-by-police-in-ashanti-region/",
    "title": "Three suspected armed robbers shot dead by Police in Ashanti region",
    "text": "Police in the Ashanti South Regional Command have shot dead three suspected armed robbers who attempted a highway robbery between Anwiankwanta and Jacobu in the Ashanti Region. Two others reportedly escaped arrest. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); The Ashanti South Regional Police Command revealed that intelligence indicated suspects Seidu, Tijani, and others—wanted in connection with several robberies and killings in Manso, Jacobu, Anwiankwanta, and surrounding areas—had gathered in a bush between Anwiankwanta and Jacobu junction, preparing to strike on the Anwiankwanta/Obuasi Highway. An intelligence-led operation, spearheaded by ASP Nana Antwi Boadu with assistance from ASP Mr Princeton Peasah and other ranks, raided the bush. On arrival, police spotted about five armed young men. “The gang, on seeing the police, opened fire and attempted to escape through the bush. Police returned fire, and three suspects sustained gunshot injuries, while the other two, with suspected gunshot wounds, managed to escape,” the command said. The three suspects were pronounced dead at the Bekwai Municipal Hospital. googletag.cmd.push(function() { googletag.display('in-article'); }); Police recovered two pump-action guns loaded with six rounds each, one unbranded pistol, a sack containing 25 live cartridges, and six spent cartridges. The deceased have been identified as Seidu Issah (29), Musah Yakubu (35), and Yahaya Munkaila, aka Tijani (25), all of Fulani extraction. According to police, the suspects admitted to multiple robberies in Jacobu and Manso, including a robbery at Jacobu Airport on November 3, 2025, which resulted in the killing of a security officer. They also confessed to highway robberies along the Manso stretch, including an incident at Antoakrom about two months ago, a robbery at Abofour Forest near Offinso on May 23, and an attack on a gold buyer at Anwiankwanta on December 8. Tijani further implicated accomplices Issah Jordorma of Asante Mampong, Seidu Haruna of Nyinahin, Ibrahim, Seidu Balli, and Abubakar of Offinso Kokote, claiming some AK-47 assault rifles are hidden in bushes at Manso and Obuasi, police said. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Anwiankwanta Christmas eve Police Robbers DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Police net 120 suspects in major East Legon drug and crime swoop Police arrest 28-year-old with 98 parcels of suspected cannabis in Tamale Christmas Eve crash kills four at Twifo Ntafrewaso Police arrest suspect for theft during Diaspora Summit 2025 in Accra Police arrest suspect involved in robbery of delivery rider at Tantra Hill Police foil suspected robbery at Ashaiman; 3 suspects killed 41 arrested in targeted police operations across Eastern Region Police arrest three individuals for impersonating public officials and online fraud Two arrested for unlawful possession of firearm, ammunition Ashanti Regional Police deploy over 1,000 officers for festive security",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/2-52-e1766838299339-679x424.jpg"
  },
  {
    "url": "https://www.myjoyonline.com/thousands-turn-aburi-gardens-into-a-festive-paradise-at-joy-fms-party-in-the-park/",
    "title": "Thousands turn Aburi Gardens into a festive paradise at Joy FM’s Party in the Park",
    "text": "The serene atmosphere at Aburi Botanical Gardens transformed into a pulsating hub of laughter, music, and unbreakable family bonds as Joy FM's annual Family Party in the Park drew thousands of Ghanaians for a celebration like no other. It was time for the major Christmas highlight, arguably Ghana's biggest family party. googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); }); As dawn broke, families, friends, and music enthusiasts flocked to the lush greenery just outside Accra, transforming the iconic Aburi gardens into a vibrant tapestry of colourful outfits, picnic blankets, and infectious energy. The air thrummed with anticipation for a day filled with live performances, games, delicious food, and unadulterated holiday cheer. When the afternoon rain started, a typical tropical shower, it might have dampened spirits elsewhere. But not here. Ghanaians know how to seize the moment, and the patrons simply laughed at the intermittent downpour, dancing through the drizzle. Some sheltered playfully under shared umbrellas or the canopy of leaves, while others let the cool drops add to the fun. Laughter echoed louder than the patter on the leaves – it was pure joy. The real stars, however, were the children, who turned every corner of the gardens into their own playground paradise. googletag.cmd.push(function() { googletag.display('in-article'); }); Bouncy castles heaved with squeals as kids launched themselves skyward, landing in heaps of giggles. Face painters worked miracles, transforming the little ones into fierce lions, glittering butterflies, and cheeky superheroes, while treasure hunts and dancing competitions sparked endless giggles and family cheers. The stage came alive with a lineup from soulful warmth to explosive energy. First, the Kwan Pa Band took the stage with their authentic palmwine highlife, guitars strumming lazily at first, then picking up into irresistible rhythms that had parents nodding knowingly while pulling their kids into gentle swaying circles. The crowd sang every word, voices blending in perfect harmony – drawing everyone into heartfelt sing-alongs that evoked cherished memories. googletag.cmd.push(function() { googletag.display(\"in-article1\"); }); Next, the incomparable Kwabena Kwabena took the microphone, marking his 20 years in music with a performance that touched the soul. His velvety voice filled the air, couples swayed arm-in-arm, families held each other close, and the entire crowd waved in unison – moments of pure magic amid the greenery. Closing the show with a bang were the dynamic twins of DopeNation, firing off hit after hit – 'Zormizor', 'Thank God', 'Gboza' – with beats that thumped through the chest. The gardens transformed into one massive dance floor; screams of delight pierced the air, hands waved frantically, and feet moved in wild, synchronised chaos. Their commanding presence and seamless twin synergy had everyone jumping, sweating, and grinning ear-to-ear – it was impossible not to move, the perfect explosive end to send the crowd home buzzing. The gardens glowed with contentment – full tummies from sponsors, delicious food stalls, weary but beaming faces, and hearts brimming with new memories. Joy FM's Party in the Park isn't just an event; it's a reminder of what matters most: family, community, and the sheer bliss of celebrating together, come rain or shine. googletag.cmd.push(function() { googletag.display('in-article2'); }); DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Aburi Botanical Garden Joy FM Party In The Park DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Joy FM Party in the Park 2025: Kwabena Kwabena takes centre stage Joy FM Party in the Park kicks off as patrons flock in amid growing excitement Joy FM Party in the Park kicks off today at Aburi Botanical Gardens Joy FM Family Party in the Park kicks off with excitement at Aburi Botanical Gardens Use of Aburi Botanical Gardens as thoroughfare by residents a major challenge – Curator Joy FM to thrill families with good music, fun activities at ‘Party in the Park’ 22 Joy FM Party in the Park 2019 in pictures Joy 99.7 FM’s fun-filled Family Party in the Park comes off Dec 14",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2025/12/IMG_1117-636x424.jpg"
  }
]
